<?php
$lang = array(
    # About WeChall
    'about_meta' => 'О сайте '.GWF_SITENAME,
    'about_pagetitle' => 'О '.GWF_SITENAME,
    'about_info' =>
        'WeChall — это сборник ссылок и сайтов, посвящённых компьютерным задачам и испытаниям.<br>',
    'about_08' => 'О WeChall (в 2008)',
    'about_08_title' => '%s: Какова цель этого сайта?',
    'about_08' => array(
        'Inferno' =>
            'Для тех, кто не знаком с сайтами с челленджами: такой сайт в основном предлагает компьютерные задачи разных типов.<br/>'.
            'Пользователи могут зарегистрироваться и начать решать задания.<br/>'.
            'Существует множество разновидностей — самые распространённые: криптография, реверсинг (crackit), стеганография, программирование, логика и математика/наука.<br/>'.
            'Сложность заданий также сильно варьируется.<br/>'.
            '<br/>'.
            'Когда я только начинал, я умел обращаться с компьютером — и, пожалуй, только это.<br/>'.
            'За пять лет я обошёл интернет вдоль и поперёк в поисках разных сайтов с челленджами.<br/>'.
            'Играл на многих из них, решил кучу задач и до сих пор продолжаю узнавать новое и интересное.<br/>'.
            '<br/>'.
            'Я также нашёл IRC-сеть, где у большинства крупных сайтов с челленджами есть свои каналы.<br/>'.
            'Там часто работают боты, которые позволяют посмотреть, как кто-то ранжируется на том или ином сайте.<br/>'.
            'Иногда экран просто заполняется такими запросами. Именно поэтому я и начал писать этот сайт.<br/>'.
            'Он позволяет пользователям видеть полную историю достижений любого игрока на всех сайтах, где он зарегистрирован.<br/>'.
            'А как это работает?<br/>'.
            '<br/>'.
            'Пользователь может указать, на каких сайтах он играет и под каким ником.<br/>'.
            'Сайты выбираются из простого выпадающего списка.<br/>'.
            'На его профиле появится запись для каждого выбранного сайта с указанным ником и описанием его позиции в рейтинге.<br/>'.
            'Так можно получить полную картину о любом игроке за один взгляд.<br/>'.
            '<br/>'.
            'Пожалуйста, простите, если список не полный — сайтов с челленджами огромное количество, и о многих я просто не знаю.<br/>'.
            'Я постараюсь собрать максимально полный список и также предоставлю код, чтобы владельцы сайтов могли добавить свои площадки в систему.<br/>'.
            '<br/>'.
            'С уважением,<br/>'.
            'Inferno',

        'gizmore' =>
            'Цель — создать глобальный рейтинг игроков.<br/>'.
            'Кроме того, мы хотим представить обзор популярных сайтов с челленджами и вдохновить игроков попробовать их.<br/>'.
            'А ещё WeChall — это моя игровая площадка для программирования :)',

        'Kender' =>
            'Ну, у меня просто стоял сервер в датацентре без особой нагрузки... :)<br/>'.
            'И, как и у многих, у меня возникла идея создать сайт со статистикой между различными сайтами с челленджами.<br/>'.
            'Надеюсь, нам удастся привлечь больше людей к решению задач и помочь новичкам открыть для себя новые сайты, помимо тех, где они уже играют.',
    ),

    # New Left Sidebar
    'li_last_active' => '%s достиг %s%% на %s',

    # Global Meta Tags on russian
    'mt_wechall' => 'ХАКНИТЕ ЭТО, Задание, Проблема, Загадка, WeChall, Глобальные, Хакер, Вебсайт, Рейтинг',
    'md_wechall' => 'Хакерские задания, которые вы сможете решить на этом сайте. — WeChall.net',

    # TextHistory
    'pt_texthis' => 'История для %s',
    'pi_texthis' => 'Полная история пользователя %s.',
    'mt_texthis' => 'WeChall, История, %s, Основной текст',
    'md_texthis' => 'Полная история и выполненные задания пользователя %s.',

    # Country Ranking
    'pt_csrank' => 'Ранг страны',
    'pi_csrank' => 'Лучшие страны по наличию хакеров.<br/>Счёт на человека (учитывает население страны).<br/>Формула: сумма(счёт)/население * 1000',
    'mt_csrank' => 'WeChall, Рейтинг стран, Глобальный рейтинг стран, Хакер, Рейтинг',
    'md_csrank' => 'Лучшие страны по уровню подготовки хакеров в мире на WeChall.net',

    'pt_crank' => '%s Список лучших — Страница %s',
    'pi_crank' => 'Лучшие хакеры и решатели задач из %s.',
    'mt_crank' => 'WeChall, Ранг страны, %s, %s Список лучших',
    'md_crank' => 'Список лучших хакеров в %s.',

    'solved_by_title' => '<a href="%s">%s</a> Герои',
    'solved_by_text' => 'Все, кто решил %s, отсортированы по дате решения.',
    'newsrow_linkt' => 'Сегодня аккаунт присоединили',
    'newsrow_link' => '%s присоединил/присоединила свой аккаунт к %s с решёнными заданиями %s.',

    # Quick Update
    'th_quickupdate' => 'Быстрое обновление',

    # Cat Ranking
    'pi_tagrank' => 'Лучшие игроки в категории %s. Учитывается рейтинг по всем сайтам, присоединённым к wechall.net %s, поэтому это не всегда наглядно.',
    'pt_tagrank' => '%s список лучших',
    'mt_tagrank' => GWF_SITENAME.', %s, список лучших, %s список лучших',
    'md_tagrank' => '%s список лучших на '.GWF_SITENAME.'. Страница %s из %s.',

    # Lang Ranking
    'logo2_hover' => '%s решено %s%% на %s',
    'pt_langrank' => '%s список лучших — страница %s/%s',
    'pit_langrank' => '%s список лучших',
    'pi_langrank' => 'Лучшие игроки на %1 сайтах.',
    'pt_rankingc' => 'Список лучших в стране',
    'mt_ranking_lang' => GWF_SITENAME.', список лучших, %s, Задание, Сайт, Список, Пересекающийся, Задание, Сайт, Сайты',
    'md_ranking_lang' => 'Лучшие хакеры на %s сайтах, зарегистрированные на '.GWF_SITENAME.'. Страница %s из %s.',

    # User Graphs
    'alt_challvotes' => 'Голоса за задание',
    'alt_graph_rank' => 'История рейтинга для %s',
    'alt_graph_rank_vs' => 'История рейтинга для %s в сравнении с %s',
    'alt_graph_totalscore' => 'График общего счёта для %s',
    'alt_graph_totalscore_vs' => 'График общего счёта для %s в сравнении с %s',

    # Site graphs
    'it_graph_sitescore' => 'История получения баллов за задания для сайта %s',
    'it_graph_siteusers' => 'Количество пользователей на %s',
    'it_graph_sitechalls' => 'Количество заданий на %s',

    # Sitemaster News
    'mnews_title' => 'Новости от администраторов',
    'mnews_body' => 'Некоторые игроки достигли 100%%, выполнив все задания сайта. Так держать! :)'.PHP_EOL.'Вы можете [url=%s]увидеть всех мастеров сайта[/url].',
    'mnews_item' => '[url=/profile/%s]%s[/url] достиг 100%% на [url=%s]%s[/url] после %s в связях, начиная с %s.',

    # Challenge News
    'cnews_title' => 'Новые задания',
    'cnews_body' => 'Новые задания, доступные на наших сайтах:'.PHP_EOL.'[url=%s]Нажмите здесь, чтобы отметить их[/url]'.PHP_EOL.PHP_EOL,
    'cnews_item' => 'Есть %s новых заданий на %s (сейчас всего %s)',

    # Birthday News!
    'bdnews_title' => 'С днём рождения!',
    'bdnews_body_init' => 'Следующие пользователи празднуют свой день рождения на этой неделе:'.PHP_EOL.'[url=%s]Нажмите здесь, чтобы отметить их[/url]'.PHP_EOL.PHP_EOL,
    'Yesterday' => 'Вчера',
    'Today' => 'Сегодня',
    'Tomorrow' => 'Завтра',
    'OtherDay' => 'На днях %s',

    'fav_links' => '%s имеет %s любимые ссылки',
    'own_links' => '%s имеет представления %s публичных ссылок',
    'logo_hover' => 'Логотип %s',

    'site_dot_red' => 'В настоящее время недоступен',
    'site_dot_green' => 'Доступен и работает',
    'site_up' => 'Оценивается',
    'site_type_2' => 'Кладбище',
    'site_type_3' => 'Скоро...',
    'site_type_4' => 'Не оценивается',

    'alt_solboard' => 'Решения',
    'alt_challboard' => 'Вопросы',

    # Page Titles
    'pt_sites_1' => 'Участвующие сайты с заданиями',
    'pt_sites_2' => 'Кладбище сайтов с заданиями',
    'pt_sites_3' => 'Сайты с заданиями — скоро...',
    'pt_sites_4' => 'Задания с сайтов не входят в рейтинг WeChall',
    'pt_site_ranking' => '%s Рейтинг — Страница %s',
    'pt_ranking' => 'Глобальный рейтинг — Страница %s',

    # Meta Description
    'md_profile' => 'Профиль WeChall %s | Место в рейтинге %s | Играет на %s сайтах | Хакерские задания на сайтах',

    # Meta Tags
    'mt_ranking' => 'Глобальный рейтинг хакерских заданий и обзор всех задач со всех сайтов',
    'mt_site_ranking' => 'WeChall, Сайт, Рейтинг, %s, Страница %s',
    'md_site_ranking' => 'WeChall — таблица рейтинга пользователей %s — страница %s',
    'mt_challs' => '%s, Компьютер, Взлом, Задания, Задание, Problems, WeChall, Non Simulated.',
    'md_challs' => '%s Задания на WeChall.',
    'mt_challs_for' => '%s, Компьютер, Взлом, Задание, Обзор, %s, WeChall',
    'md_challs_for' => '%s Обзор заданий для %s на WeChall.',
    'mt_challs_from' => '%s, Компьютер, Взлом, Задание, %s, WeChall',
    'md_challs_from' => 'Задания сделаны %s на WeChall.',
    'mt_sites_1' => 'WeChall, Участвующие, Активные, Задание, Сайты',
    'md_sites_1' => 'Участвующие и активные задания на сайтах, перечисленных на WeChall.',
    'mt_sites_2' => 'WeChall, Задание, Site, Graveyard',
    'md_sites_2' => 'Задания — «кладбище сайтов» на WeChall.',
    'mt_sites_3' => 'Задание, Site, Обзор, Coming, Soon, WeChall',
    'md_sites_3' => 'Задания с сайтов, которые скоро войдут в рейтинг на WeChall.',
    'mt_sites_4' => 'Другие, Дополнительно, Задания, Сайты, Не вошедшие в рейтинг, WeChall',
    'md_sites_4' => 'Другие задания с сайтов, которые ещё не вошли в рейтинг на WeChall.',

    # Info
    'pt_graveyard' => 'Кладбище',
    'pi_graveyard' => 'Эти сайты были неактивны в прошлом и, к сожалению, их больше нет с нами.',
    'pi_login_link' => '<a href="%s">Нажмите здесь, чтобы вернуться к последнему местоположению на сайте: %s</a>',
    'pi_site_urls' => 'Шаблоны URL заменяют %USERNAME%, %EMAIL% и %AUTHKEY%.',
    'pi_ug_info' => '%s является основателем группы &quot;%s&quot;, в которой %s пользователей.',
    'pi_ug_join' => 'Вы можете <a href="%s">вступить в группу, нажав здесь</a>.',
    'pi_ug_register' => 'Вам необходимо <a href="%s">зарегистрироваться</a>, чтобы присоединиться к группе.',
    'pit_ranking' => 'Полный рейтинг',
    'pi_ranking' => 'Лучшие хакеры и решатели заданий во всём мире (зарегистрированные на WeChall).',
    'pi_viewcount' => 'Эта страница была просмотрена %s раз.',
    'pi_site_masters' => 'Все пользователи, которые в данный момент имеют 100%% на каком-либо сайте.',
    'pi_site_masters_old' => 'Все пользователи, которые когда-либо достигали 100%% на сайте.',

    # Header
    'a_title' => 'Всего очков: %s',
    'head_sites' => 'Новые сайты',
    'head_users' => '<a href="%s">Новые пользователи</a>',
    'head_online' => '%s онлайн',

    # Challenge
    'chall_solvecount' => 'Решено %s человеком/людьми',
    'chall_added' => 'с',

    # Table Titles
    'tt_challs' => '%s Задания',
    'tt_challs_for' => '%s Задание(я) просмотрено %s',
    'tt_challs_from' => '%s %s Проблемы предоставлены %s',

    # Form Titles
    'ft_solution' => 'Ваше решение для %s',
    'ft_edit_chall' => 'Редактировать это задание',
    'ft_link_site' => 'Ссылка на сайт с вашим аккаунтом',
    'ft_linked_sites' => 'Ваши связанные сайты',
    'ft_add_site' => 'Добавить новый сайт',
    'ft_edit_site' => 'Редактировать %s',
    'ft_edit_site_logo' => 'Редактировать логотип %s',
    'ft_edit_site_admin' => 'Добавить или удалить администратора сайта',
    'ft_vote_chall' => 'Голосуйте за задание %s',

    # Graph Titles
    'gt_site_sitehist_score' => 'График очков %s',
    'gt_site_sitehist_usercount' => 'Количество пользователей %s',
    'gt_site_sitehist_challcount' => 'Количество вызовов на %s',
    'gt_user_level' => 'График всех очков для %s',

    # Menu
    'menu_news' => 'Новости',
    'menu_register' => 'Регистрация',
    'menu_logout' => 'Выйти',
    'menu_about' => 'О нас',
    'menu_links' => 'Ссылки',
    'menu_sites' => 'Сайты',
    'menu_forum' => 'Форум',
    'menu_ranking' => 'Рейтинг',
    'menu_challs' => 'Задания',
    'menu_account' => 'Аккаунт',
    'menu_pm' => 'Личные сообщения',
    'menu_stats' => 'Ваша статистика',
    'menu_chat' => 'Чат',
    'menu_admin' => 'Администратор',

    # Right Panel
    'rp_stats' => 'Статистика',
    'rp_sitecount' => '%s Сайтов',
    'rp_challcount' => '%s Задания',
    'rp_postcount' => '%s Сообщения',
    'rp_usercount' => '%s Пользователи',
    'rp_sites' => '%s Активные сайты',
    'rp_topusers' => 'Лучшие %s игроки',
    'rp_last_active' => 'Последняя %s активность',
    'rp_donations' => '%s Пожертвования',
    'rp_shop' => '%s Магазин',


    # Left Panel
    'lp_last_online' => 'Онлайн в течение %s',
    'lp_last_online2' => '<a href="%s">%s пользователей</a>',
    'lp_language' => 'Язык',

    # Footer
    'footer_1' => '©2008-%s согласно wechall.net; <a href="%s">Весь код</a> работает в соответствии с условиями <a href="'.GWF_WEB_ROOT.'wechall_license">Публичной лицензии WeChall</a>; Вы можете <a href="'.GWF_WEB_ROOT.'contact">связаться с нами</a>.',
    'footer_2' => '%s пользователей были онлайн %s<br/>%s страниц обработано к настоящему времени',

    # Register
    'register_tos' => 'Регистрируясь на WeChall.net, вы соглашаетесь с нашей <a href="%s">лицензией и условиями</a>.',
    'register_forgot' => 'Если вы забыли пароль или не пришло письмо для активации, <a href="%s">нажмите здесь</a>.',

    # Admin Config (placeholder header only)

    # Table Headers
    'th_csolve_date' => 'Решено',
    'th_site_tags' => 'Категории меток',
    'th_score' => 'Счёт',
    'th_totalscore' => 'Всего очков',
    'th_site_country' => '',
    'th_site_country2' => 'Страна происхождения сайта',
    'th_site_language' => 'Язык',
    'th_site_language2' => 'Основной язык сайта',
    'th_site_name' => 'Сайт',
    'th_site_logo' => 'Логотип',
    'th_site_classname' => 'Имя класса',
    'th_site_score' => 'Счёт',
    'th_site_basescore' => 'Базовый счёт',
    'th_site_usercount' => 'Пользователи',
    'th_site_challcount' => 'Задания',
    'th_site_admins' => 'Администраторы сайта',
    'th_site_autoup' => 'Авто-обновление',
    'th_site_linkcount' => 'Связанные пользователи',
    'th_site_dif' => 'Сложность',
    'th_site_fun' => 'Веселье',
    'th_site_avg' => 'Среднее',
    'th_site_vote_dif' => 'Не весёлый',
    'th_site_vote_fun' => 'Весёлый',
    'th_site_description' => 'Описание',
    'th_site_status' => 'Статус',
    'th_autoupdate' => 'Сайт обновляется автоматически?',
    'th_default_hide' => 'Имя сайта скрыто по умолчанию?',
    'th_site_joindate' => 'Сайты по дате присоединения',
    'th_site_launchdate' => 'Сайты по дате запуска',
    'th_site_authkey' => 'Личный секрет Authkey',
    'th_site_xauthkey' => 'Публичный секрет X-Authkey',
    'th_site_irc' => 'Контакт IRC',
    'th_site_url' => 'URL сайта',
    'th_site_url_mail' => 'URL шаблона почты',
    'th_site_url_score' => 'URL шаблона очков',
    'th_site_url_profile' => 'URL шаблона профиля',
    'th_site_new_logo' => 'Новое лого',
    'th_onsite_name' => 'Имя пользователя',
    'th_email' => 'Email адрес',
    'th_chall_score' => 'Очки',
    'th_chall_title' => 'Название',
    'th_chall_solvecount' => 'Кто смог решить',
    'th_chall_date' => 'Возраст',
    'th_chall_creator_name' => 'Автор',
    'th_dif' => 'Сложность',
    'th_edu' => 'Образование',
    'th_fun' => 'Веселье',
    'th_forum' => 'Форумы',
    'th_regat_solved' => 'Решено',
    'th_regat_lastdate' => 'Последнее обновление',
    'th_regat_onsitename' => 'Имя пользователя',
    'th_regat_onsitescore' => 'Процент',
    'th_auto_update' => 'Автоматическое обновление',
    'th_latest_players' => 'Последняя %s активность игроков, по последнему обновлению (%s)',
    'th_solution' => 'Ответ',
    'th_chall_votecount' => 'Голосов',
    'th_user_level' => 'Всего очков',
    'th_user_name' => 'Имя пользователя',
    'th_sitemas_date' => 'Мастер с',
    'th_sitemas_firstdate' => 'Первый трек',
    'th_sitemas_tracktime' => 'Трек-время',
    'th_sitemas_startperc' => 'Для',
    'th_rank' => '#',
    'th_rank2' => 'Глобальный рейтинг',
    'th_crank' => 'Ранг страны',
    'th_last_activites' => 'Последняя активность %s',
    'th_progress' => 'Прогресс',
    'th_num_linked' => 'Сайты',
    'th_favsites' => 'Любимые сайты',
    'th_userhist_date' => 'Дата',
    'th_userhist_comment' => 'Комментарий',
    'th_userhist_percent' => '%',

    'th_user_countryid' => 'Страна',
    'th_players' => 'Игроки',
    'th_avg' => 'В среднем',
    'th_sumtop3' => 'Сумма (Топ-3)',
    'th_top_player' => 'Лучший игрок',

    # Errors
    'err_parse_stub' => 'Метод parseStats() не реализован для сайта %s.<br/>Пожалуйста, реализуй это, дружище!',
    'err_password' => 'Вы ввели неправильный пароль!',
    'err_wrong' => 'Ох… Неправильный ответ!',
    'err_chall' => 'Неизвестное задание.',
    'err_chall_score' => 'Очки за задания должны быть между 1 и 10.',
    'err_chall_creator' => 'Следующие создатели неизвестны: %s.',
    'err_chall_tags' => 'Следующие теги неверны: %s.',
    'err_chall_url' => 'URL задания введён неверно.',
    'err_site_down' => 'Сбой в процессе обновления. %s Что-то пошло не так.',
    'err_site_dup' => 'Название сайта уже существует.',
    'err_classname_dup' => 'Имя класса уже существует для сайта.',
    'err_site' => 'Неизвестное задание.',
    'err_site_name' => 'Имя сайта недействительно. Должно быть от %s до %s символов.',
    'err_site_classname' => 'Имя класса недействительно. Должно быть от %s до %s ASCII-символов.',
    'err_not_linked' => 'Вы не связаны с %s.',
    'err_site_basescore' => 'Базовые очки сайта должны быть между %s и %s.',
    'err_site_usercount' => 'Число пользователей сайта должно быть между %s и %s.',
    'err_site_challcount' => 'Количество заданий сайта должно быть между %s и %s.',
    'err_site_joindate' => 'Дата присоединения к сайту неверна.',
    'err_site_launchdate' => 'Дата запуска сайта недействительна.',
    'err_site_authkey' => 'Ключ аутентификации сайта неверен. Максимум %2$s символов.',
    'err_site_xauthkey' => 'Ключ X-Authkey неверен. Максимум %2$s символов.',
    'err_site_url' => 'URL сайта неверен. Должен быть длиной %s–%s символов.',
    'err_site_url_mail' => 'Auth-URL сайта неверен. Должен быть длиной %s–%s символов.',
    'err_site_url_score' => 'URL источника очков недействителен. Должен быть длиной %s–%s символов.',
    'err_site_url_profile' => 'Профильный URL недействителен. Должен быть длиной %s–%s символов.',
    'err_site_description' => 'Описание сайта недействительно. Максимум %2$s символов.',
    'err_site_irc'  => 'IRC-сервер сайта недействителен. Должен быть длиной %s–%s символов.',
    'err_site_tags'  => 'Один или несколько тегов сайта недействительны (3–32 символа, только буквы/цифры, начинаются с буквы, регистр учитывается).',
    'err_write_logo' => 'Невозможно записать логотип %s.',
    'err_no_logo' => 'Отправленный файл не является изображением.',
    'err_email' => 'Ваш e-mail выглядит неверно.',
    'err_link_account' => 'Комбинация имя пользователя/e-mail не существует… печаль… %s.',
    'err_already_linked' => 'Вы уже связаны с %s.',
    'err_sitemin_dup' => 'Пользователь %s уже является администратором на %s.',
    'err_onsitename' => 'Имя пользователя не существует на %s.',
    'err_response' => '<pre>%s</pre> не является допустимым ответом от %s.',
    'err_already_linked2' => 'Пользователь %s уже связан с %s.',
    'err_chall_vote' => 'Сначала нужно решить задачу.',
    'err_dif' => 'Ваше значение сложности вне диапазона (0–10).',
    'err_edu' => 'Ваше значение «образование» вне диапазона (0–10).',
    'err_fun' => 'Ваше значение «веселье» вне диапазона (0–10).',
    'err_create_gb' => 'Вы не можете создать гостевую книгу.',
    'err_have_gb' => 'У вас уже есть гостевая книга.',
    'err_graph_empty' => 'Этот график пуст.',
    'err_notlinkedwc' => 'Ваш аккаунт не связан с WeChall.',
    'err_no_sites' => 'Вы должны указать хотя бы один сайт.',

    # Site States
    'site_state_up' => 'Работает',
    'site_state_down' => 'Временно недоступен',
    'site_state_dead' => 'Их уже нет с нами',
    'site_state_wanted' => 'Разыскивается',
    'site_state_refused' => 'Отказался от участия',
    'site_state_contacted' => 'Связались',
    'site_state_coming_soon' => 'Скоро...',

    # Messages
    'msg_correct' => 'Вы ответили правильно. Поздравляем, вы решили это задание.<br/>Пожалуйста, <a href="%s">проголосуйте за это задание</a>.<br/>Вы также можете открыть <a href="%s">доску решений</a> для этого задания.',
    'msg_correct_alpha' => 'Вы ответили правильно, но задача ещё не установлена.',
    'msg_correct_again' => 'Вы ответили правильно, но уже решали это задание ранее.<br/>Уже <a href="%s">проголосовали за него</a>?',
    'msg_correct_guest' => 'Вы ответили правильно. Чтобы отслеживать прогресс, зарегистрируйтесь.',
    'msg_chall_edited' => 'Задание отредактировано.',
    'msg_chall_installed' => 'Задание %s установлено и готово быть решённым :)',
    'msg_chall_deleted' => 'Задача была удалена.',
    'msg_cached_ctags' => 'Теги задания обновлены.',
    'msg_site_added' => 'Новое задание добавлено на сайт.',
    'msg_site_edited' => 'Сайт %s был изменён.',
    'msg_site_recalc' => 'Пересчёт всех очков для %s.',
    'msg_sites_recalc' => 'Пересчёт всех очков.',
    'msg_site_linked' => 'Ваш аккаунт %s успешно присоединён.',
    'msg_site_unlinked' => 'Ваш аккаунт %s успешно отсоединён.',
    'msg_hide_sitename_1' => 'Ваше имя пользователя для %s теперь скрыто.',
    'msg_hide_sitename_0' => 'Ваше имя пользователя для %s теперь отображается.',
    'msg_updating' => 'Обновляем ваш статус для %s.',
    'msg_sitemin_add' => 'Добавлен %s как администратор сайта для %s.',
    'msg_sitemin_rem' => '%s больше не администратор сайта %s.',
    'msg_no_change' => 'Ничего не изменилось.',
    'msg_chall_voted' => 'Спасибо за ваш голос.',
    'msg_created_gb' => 'Ваша гостевая книга создана. Вы можете <a href="%s">настроить её здесь</a>.',
    'msg_bd_marked' => 'Дни рождения на этой неделе отмечены как прочитанные.',
    'msg_challs_marked' => 'Новости по заданиям отмечены как прочитанные.',
    'msg_marked_fav' => '%s теперь отмечен как один из ваших любимых сайтов.',
    'msg_unmarked_fav' => '%s больше не в списке ваших любимых сайтов.',

    # Buttons
    'btn_pm' => 'Личные сообщения %s',
    //'btn_email' => 'Send EMail to %s',
    'btn_solve' => 'Отправить',
    'btn_link' => 'Ссылка на сайт',
    'btn_linked_sites' => 'Связанные сайты',
    'btn_edit_profile' => 'Изменить профиль',
    'btn_account' => 'Настройки учётной записи',
    'btn_pm_settings' => 'Настройки личных сообщений',
    'btn_forum_settings' => 'Настройки форума',
    'btn_delete_account' => 'Удалить аккаунт',
    'btn_view_profile' => 'Посмотреть профиль',
    'btn_add_site' => 'Добавить сайт',
    'btn_active_sites' => 'Активные сайты',
    'btn_graveyard' => 'Кладбище',
    'btn_not_ranked' => 'Вне рейтинга',
    'btn_coming_soon' => 'Скоро...',
    'btn_edit_site' => 'Изменить сайт',
    'btn_sidebar_on' => 'Скрыть боковую панель',
    'btn_sidebar_off' => 'Показать боковую панель',
    'btn_update_one' => 'Обновления пользователя',
    'btn_update_all' => 'Обновления всех пользователей',
    'btn_update_all_sites' => 'Обновления всех сайтов',
    'btn_set_logo' => 'Установить логотип',
    'btn_update' => 'Обновление',
    'btn_unlink' => 'Разъединить',
    'btn_hide' => 'Скрыть',
    'btn_show' => 'Показать',
    'btn_manage_gb' => 'Управление гостевой книгой',
    'btn_manage_ug' => 'Управление группами пользователей',
    'btn_vote' => 'Голосовать',
    'btn_quickjump' => 'Быстрый переход',
    'btn_ranking' => 'Рейтинг',
    'btn_global_rank' => 'Глобальный рейтинг',
    'btn_active_rank' => 'Рейтинг активных сайтов',
    'btn_lang_rank' => 'Рейтинг по языкам',
    'btn_country_rank' => 'Рейтинг по странам',
    'btn_tag_rank' => 'Рейтинг по категориям',
    'btn_grp_rank' => 'Групповой рейтинг',
    'btn_rem_logo' => 'Удалить логотип',
    'btn_add_sitemin' => 'Добавить администратора сайта',
    'btn_rem_sitemin' => 'Удалить администратора сайта',
    'btn_remove' => 'Удалить',
    'btn_view_groups' => 'Посмотреть группы',
    # Challenge->Forum
    'chall_help_desc' => 'Помощь по заданию %s',
    'chall_solution_desc' => 'Решения для задания %s',

    # Email on Link Site
    'mail_link_subj' => GWF_SITENAME.': Ссылка на аккаунт %s',
    'mail_link_body' =>
        'Привет %s'.PHP_EOL.
        PHP_EOL.
        'Похоже, вы пытаетесь связать свой аккаунт %s с '.GWF_SITENAME.'.'.PHP_EOL.
        'Чтобы подтвердить, что вы владелец этого аккаунта, перейдите по ссылке ниже.'.PHP_EOL.
        PHP_EOL.
        '%s'.PHP_EOL.
        PHP_EOL.
        'Если вы не запрашивали эту связь, можете просто проигнорировать сообщение или написать нам на '.GWF_ADMIN_EMAIL.'.'.PHP_EOL.
        PHP_EOL.
        'С наилучшими пожеланиями,'.PHP_EOL.
        'Скрипт WeChall ^_^',

    # Admin config
    'cfg_wc_basescore' => 'Базовые очки WeChall',
    'cfg_wc_graph_w' => 'Ширина глобального графика',
    'cfg_wc_graph_h' => 'Высота глобального графика',
    'cfg_wc_ipp' => 'Элементов на странице',
    'cfg_wc_score_chall' => 'Начальные очки за задания',
    'cfg_wc_sitename_len' => 'Максимальная длина имени сайта',
    'cfg_wc_chall_board' => 'ID доски заданий',
    'cfg_wc_ctags' => 'Теги заданий',
    'cfg_wc_site_board' => 'ID доски сайтов',
    'cfg_wc_sol_board' => 'ID доски решений',
    'cfg_wc_uid' => 'ID пользователя WeChall',
    'cfg_wc_jpgraph' => 'Папка JPGraph',
    'cfg_wc_lpt' => 'Последние игроки',
    'cfg_wc_sitemas_dur' => 'Длительность новостей',

    # Fav sites
    'pt_sitefav' => 'Ваши любимые сайты с заданиями',
    'pi_sitefav' => 'Выберите ваши любимые сайты, чтобы они отображались в быстром переходе и профиле.',
    'btn_fav_sites' => 'Любимые сайты',
    'th_selfavsite' => 'Быстрый переход',
    'th_selfavsite2' => 'Выбрать сайт',
    'ft_favsites' => 'Добавить любимый сайт',
    'th_sel_favsite' => 'Выберите сайт',
    'btn_add_favsite' => 'Добавить',

    # Site Detail
    'pt_site_detail' => '%s — детали',
    'mt_site_detail' => '%s, Задание, Сайт, Детали, Обзор, WeChall',
    'md_site_detail' => 'Детали заданий сайта %s на WeChall',

    # Statgraph
    'err_end_date' => 'Неверная конечная дата.',
    'percentage' => 'Процент(ов)',

    # Join Box
    'sites_join_t' => 'Как добавить другие сайты в WeChall',
    'sites_join_b' =>
        'Если вы автор заданий, прочитайте <a href="%s">join.php</a>.<br/>'.
        'Если хотите добавить любимый сайт — свяжитесь с его администраторами.<br/>'.
        'Пожалуйста, не публикуйте решения заданий WeChall на открытых форумах.',

    # V4.01
    'menu_groups' => 'Группы',
    'btn_site_masters' => 'Мастера сайта',
    'cfg_wc_active_time' => 'Время активности пользователя',

    # v4.02 (Freeze)
    'err_frozen' => 'Ваш счёт заморожен. Вы не можете разорвать связь с сайтом.',
    'err_site_ban' => 'Вы забанены на %s. Связать нельзя.',
    'ft_freeze' => 'Отметить пользователя как забаненного на сайте',
    'btn_freeze' => 'Заморозить!',
    'btn_unfreeze' => 'Разбанить',
    'msg_frozen' => 'Пользователь %s теперь забанен на %s.',
    'msg_unfrozen' => 'Пользователь %s разбанен на %s.',

    # v4.03 (finish)
    'scorefaq_box' => 'Как <a href="%s">набирать очки</a> и продвигаться на WeChall',
    'err_bot_challenge' => 'Поисковые роботы не могут решать задачи.',

    # v4.04 (fixes+stats)
    'msg_linkmail_sent' => 'Письмо отправлено на ваш адрес. Следуйте инструкциям для связывания учётной записи.',

    'pt_stats' => 'Статистика %s',
    'md_stats' => GWF_SITENAME.' — статистика для %s.',
    'mt_stats' => GWF_SITENAME.', Статистика, %s, Графики',
    'pt_stats2' => 'Статистика %s vs %s',
    'md_stats2' => GWF_SITENAME.' — статистика %s против %s.',
    'mt_stats2' => GWF_SITENAME.', Статистика, %s, против, %s, Графики',

    'stat_high' => 'Высокий ранг',
    'stat_med' => 'Средний ранг',
    'stat_low' => 'Низкий ранг',
    'btn_show_stats_all' => 'Показать все сайты',
    'btn_show_stats' => 'Обновить',
    'chk_icons' => 'Иконки',
    'chk_values' => 'Значения',
    'chk_zoom' => 'Увеличить',

    # v4.02 extras
    'btn_all_sites' => 'Все сайты',
    'pt_sites_5' => 'Все сайты, перечисленные на '.GWF_SITENAME,
    'pt_sites_5_tagged' => 'Сайты с категорией %s на '.GWF_SITENAME,
    'th_site_country_detail' => 'Сайты по странам',
    'site_detail_uinfo' => '%s имеет оценку %s/%s на %s (%s%%). Ранг %s на '.GWF_SITENAME.', очков %s.',

    # v4.03 login etc
    'ft_signup' => 'Регистрация',
    'th_password' => 'Пароль',
    'th_bind_ip' => 'Привязать сессию к IP',
    'btn_forgot_pw' => 'Забыли пароль',
    'btn_login' => 'Войти',
    'bd_over' => 'Предыдущий %s',
    'bd_soon' => 'Следующий %s',

    'btn_close' => 'Закрыть',
    'btn_guestbook' => 'Гостевая книга',

    # v4.04
    'err_site_down' => '%s сейчас недоступен.',

    # v4.05 (Private History)
    'ft_settings' => GWF_SITENAME.' — Настройки',
    'btn_set_settings' => 'Сохранить настройки',
    'btn_wc_settings' => GWF_SITENAME.' — Настройки',
    'th_priv_history' => 'Личная история',
    'tt_priv_history' => 'Вы можете скрыть или показать даты последней активности в профиле.',
    'msg_priv_hist_0' => 'История теперь показывает даты активности.',
    'msg_priv_hist_1' => 'История теперь приватна и не показывает даты активности.',
    # v4.06 (UserHistory Multi-Lang)
    'userhist_link' => 'Связаны аккаунты %1$s с %3$s%% (%2$s очков)',
    'userhist_unlink' => 'Отвязал аккаунт от %s (%s очков)',
    'userhist_gain' => 'Получено %4$s%% на %1$s (%2$s очков)',
    'userhist_lost' => 'Потеряно %4$s%% на %1$s (%2$s очков)',
    'userhist_ban' => 'Был забанен на %s (%s очков)',
    'userhist_unban' => 'Был разбанен на %s',
    'userhist_unknown' => 'Обновил свой аккаунт на %s',

    # v4.07 (More settings and join us)
    'tt_no_xss' => 'Можно исключить себя из некоторых кросс-сайт запросов, выполняемых через WeChall API.',
    'th_no_xss' => 'Скрыть от API',
    'msg_no_xss_0' => 'Ваши данные учётной записи сейчас видны WeChall API.',
    'msg_no_xss_1' => 'Ваши данные учётной записи сейчас скрыты от WeChall API.',
    'menu_join' => 'Присоединиться к нам',

    # v4.08 (XSS Pass)
    'th_xss_pass' => 'API-пароль',
    'tt_xss_pass' => 'Вы можете установить пароль для API-вызовов, чтобы доверенные пользователи могли обращаться всегда.',
    'msg_xss_pass_0' => 'Личный API-пароль удалён.',
    'msg_xss_pass_1' => 'Личный API-пароль установлен.<br/>Чтобы защитить аккаунт от API-вызовов, включите соответствующую галочку.',
    'err_api_block' => 'Пожалуйста, подождите перед следующим запросом. Если нужно больше запросов — свяжитесь с нами для мастер-ключа.',

    # v4.09 (onsiterank)
    'th_site_has_osr' => 'Имеет ранг на сайте',
    'btn_site_masters_old' => 'Старые мастера',
    'btn_site_details' => 'Детали',

    # v4.10 (hardlink)
    'msg_hardlinked' => 'Пользователь %s связан как %s на сайте %s.',
    'err_onsitename_taken' => 'Имя пользователя %s на %s уже занято %s.',

    # v4.11
    'err_solution_block' => 'Слишком много ответов за короткое время. Подождите %s перед следующим вводом.',

    'err_link_account_hts' => 'Комбинация имени пользователя/пароля не существует на %1$s.<br/>На %1$s нужно активировать wechall для аккаунта.<br/><a href="http://www.hackthissite.org/pages/user/affiliate.php">http://www.hackthissite.org/pages/user/affiliate.php</a>',

    'th_spc' => 'SpC', # оставить как есть

    # v4.12
    'msg_wmc_sol_inserted' => 'Ваше решение длиной %s сохранено в базе.<br/>Теперь вы можете <a href="%s">искать решения</a> длиной ≥ %1$s.',
    'th_length' => 'Длина',
    'err_token' => 'Ваш токен недействителен.',
    'pt_wmc_sol' => 'Решения %s длиной ≥ %s',
    'menu_contact' => 'Контакт',
    'msg_wmc_solved' => 'Вы решили задание %s. Можно <a href="%s">просмотреть все решения</a>, если хотите.',

    # v4.13
    'th_csolve_time_taken' => 'Время',
    'menu_stats2' => 'Статистика',
    'stat_vs' => 'Против',
    'btn_show_stats_none' => 'Нет сайтов',

    # v4.14
    'ft_favcats' => 'Добавить любимую категорию',
    'th_sel_favcat' => 'Выбрать категорию',
    'btn_add_favcat' => 'Добавить категорию',
    'th_cat' => 'Категория',
    'err_cat' => 'Эта категория неизвестна.',
    'msg_add_favcat' => '%s добавлена в список ваших любимых категорий.',
    'th_favcats' => 'Любимые категории',
    'btn_site_history' => 'История',
    'btn_site_rank' => 'Рейтинг сайта',

    # v4.15
    'err_site_spc' => 'Начальные очки за задания указаны неверно.',
    'err_site_powarg' => 'Неверная степень.',
    'th_site_spc' => 'Начальные очки за задания',
    'th_site_powarg' => 'pow(x,y) — показатель степени y',

    # v4.16 (multilang descr)
    'th_is_default' => 'По умолчанию?',
    'btn_add' => 'Добавить',
    'btn_edit' => 'Редактировать',
    'btn_delete' => 'Удалить',
    'btn_set_default' => 'Сделать стандартным',
    'ft_add_descr' => 'Добавить описание',
    'ft_edit_descr' => 'Изменить описание на %s',
    'err_descr' => 'Описание недействительно. Длина должна быть %s–%s символов.',
    'err_descr_new' => 'Описание недействительно. Длина должна быть %s–%s символов.',
    'err_dup_descr' => 'Описание на этом языке уже существует. Используйте редактирование.',
    'err_del_default_descr' => 'Нельзя удалить описание по умолчанию.',
    'msg_edit_descr' => 'Описание отредактировано.',
    'msg_del_descr' => 'Описание удалено.',
    'msg_add_descr' => 'Описание добавлено.',
    'msg_def_descr' => 'Описание по умолчанию изменено на %s.',
    'btn_edit_site_descr' => 'Редактировать описание сайта',

    # v4.17 (Hide ranking)
    'th_hide_rank' => 'Скрыть свой ранг',
    'tt_hide_rank' => 'Исключить себя из таблицы рейтинга.',
    'th_hide_score' => 'Скрыть свои очки',
    'tt_hide_score' => 'Скрыть очки и проценты в профиле.',
    'msg_hide_rank_1' => 'Ваш ранг теперь скрыт в профиле и рейтингах.',
    'msg_hide_rank_0' => 'Ваш ранг теперь виден в профиле и рейтингах.',
    'msg_hide_score_1' => 'Ваши очки и проценты теперь скрыты в профиле.',
    'msg_hide_score_0' => 'Ваши очки и проценты теперь видны в профиле.',
    'hidden' => 'Скрыто',

    # v5.00 (fixes)
    'msg_rem_favcat' => 'Категория «%s» удалена из ваших любимых.',
    'err_site_status' => 'Состояния сайтов сейчас недействительны.',
    'menu_download' => 'Загрузки',

    # WC5 (monnino fixes)
    'th_site_color' => 'Цвет сайта',
    'th_onsitename' => 'Пользователь на сайте',
    'pi_site_tags' => 'Теги сайта',
    'ft_hardlink' => 'Жёсткая привязка учётной записи',
    'btn_hardlink' => 'Привязать',
    'goto_chall' => 'Перейти к заданию %s',
    'menu_papers' => 'Публикации',
    'btn_stats' => 'Сравнение игроков',
    'btn_your_stats' => 'Ваша статистика',
    'menu_changes' => 'Изменения',
    'btn_helpdesk' => 'Служба поддержки',

    # v5.01 (chall filter)
    'btn_all' => 'Все',
    'btn_open' => 'Открытые',
    'th_no_urlencode' => 'Не кодировать URL',
    'tt_no_urlencode' => 'Отключить URL-кодирование параметров. Не рекомендуется!',

    # v5.02 (EPOCH_WARBOX)
    'btn_warboxes' => 'WarBoxes',
    'err_warbox_nick' => 'Не нужно и нельзя выбирать другое прозвище на Warbox.',
    'title_wartoken' => 'WarTokens',
    'info_wartoken' => 'На многих Warbox нет индивидуальных учётных записей. Вместо этого вы можете идентифицировать себя с Warbox на WeChall, используя «WarToken».<br/><br/>Обратите внимание, что вам всё равно нужно связать сайт на странице учётной записи (с данными по умолчанию).<br/><br/>%s первым сделал возможным начисление очков за warbox через ident. Позже появились расширения, позволяющие работать и там, где ident недоступен (или затруднён).',
    'title_warboxes' => 'Помощь Warboxes',
    'info_warboxes' => 'Просто решите задачу на Warbox. Войдя с паролем/флагом, выполните одну из команд:<br/><br/>Некоторые сайты (например <a href="https://overthewire.org/information/wechall.html">OTW</a>) дают свои команды, например:<br/><i>%s</i><br/><br/>Метод через ident (больше не поддерживается для OTW):<br/><i>%s</i><br/><br/>Метод без ident по SSL:<br/><i>%s</i><br/><br/>Готово!<br/><br/>Можно <a href="%s">связать Warbox</a> как обычный сайт.<br/><br/><a href="%s">У меня новый Warbox — как добавить?</a>',
    'title_your_wartoken' => 'Ваш текущий WarToken',
    'title_warcredits' => 'Идея Warbox',
    'info_warcredits' => 'Огромная благодарность %s за идею и реализацию!',
    'pi_warboxes' => 'Режим Warbox — для коробок-оболочек без личных учётных записей',
    'on_warbox_on' => 'Режим Warbox включён. Линки и начисление очков перенесены на %s.',
    'on_warbox_off' => 'Режим Warbox отключён.',
    'info_see_below' => 'См. ниже',

    # v5.03 (AWESOME_WARBOXES)
    'ft_add_warbox' => 'Добавить Warbox',
    'ft_edit_warbox' => 'Редактировать Warbox',
    'btn_add_warbox' => 'Добавить Warbox',
    'btn_edit_warbox' => 'Редактировать Warbox',
    'wb_up' => 'Вверх',
    'wb_down' => 'Вниз',
    'wb_dead' => 'Мёртвый',
    'th_warbox' => 'Режим Warbox?',
    'th_wb_name' => 'Имя',
    'th_wb_url' => 'Веб-сайт',
    'th_wb_host' => 'Хост',
    'th_wb_port' => 'Порт',
    'th_wb_user' => 'Логин',
    'th_wb_pass' => 'Пароль',
    'th_wb_wlist' => 'Белый список',
    'th_wb_blist' => 'Чёрный список',
    'th_wb_launch' => 'Дата запуска',
    'th_wb_status' => 'Статус',
    'err_warhost' => 'Недоступное имя хоста.',
    'err_port' => 'Порт должен быть между %s и %s.',
    'err_launch' => 'Дата запуска должна быть действительной.',
    'err_wb_status' => 'Неверный статус.',
    'err_name' => 'Название должно быть длиной %s–%s символов.',
    'msg_warbox_added' => 'Warbox добавлен на ваш сайт.',
    'msg_warbox_edited' => 'Конфигурация Warbox отредактирована.',

    # 5.06 (wargames)
    'title_warboxes_details' => 'Warboxes на %s',
    'info_warboxes_details' => 'На %1$s доступно %2$s Warbox(ов). Нажмите на уровни, чтобы увидеть все уровни. Нажмите на игроков, чтобы открыть рейтинг.',
    'title_warbox_details' => 'Уровни %2$s на %1$s',
    'info_warbox_details' => 'Сейчас доступно %3$s уровней для %2$s на %1$s. Учтите, что в SSH-wargames уровни добавляются при первом прохождении.',
    'title_warflag_solvers' => 'Решившие %2$s на %3$s — %4$s',
    'info_warflag_solvers' => '%s человек(а) решили %s на %4$s. Список в хронологическом порядке.',
    'title_warbox_players' => 'Рейтинг для %2$s — %3$s',
    'info_warbox_players' => 'Все %s игроков, вошедших в рейтинг %s — %s, отсортированы по очкам и последней активности.',

    # 5.07 (warflags finish)
    'err_warbox' => 'Warbox неизвестен для данного сайта.',
    'err_warflag' => 'Эта задача неизвестна.',

    # 5.08 (minifixes)
    'more_online' => 'больше...',

    # 5.09 (hackerspace)
    'btn_hackerspace' => 'Хакерское пространство',

    # 5.10 (SiteRSS)
    'siterss_title' => 'Последняя активность %s',
    'siterssi_title' => 'Активность %s',

    # 5.11 (ActiveSiteRanking)
    'pi_activerank' => 'Новый рейтинг суммирует только активные сайты. Пока функциональность ограничена: нет корректной подсветки и ссылки из профилей сюда не ведут.',

    # 5.12 (SiteAdmin alerts)
    'btn_alert_site_admins' => 'Оповестить администраторов сайта',
    'ft_alert_site_admins' => 'Отправить письмо администраторам сайта',
    'th_site' => 'Сайт',
    'th_title' => 'Тема',
    'th_message' => 'Сообщение',
    'err_title' => 'Тема должна быть длиной %s–%s символов.',
    'err_message' => 'Сообщение должно быть длиной %s–%s символов.',
    'mail_subj_alert_sitemins' => GWF_SITENAME . ': Информация для администраторов сайта',
    'mail_body_alert_sitemins' => '
Уважаемый(ая) %s<br/>,
<br/>
Создано оповещение для администраторов сайта пользователем %s.<br/>
Ниже приведены тема и сообщение.<br/>
<br/>
===============================================<br/>
Тема: %s<br/>
===============================================<br/>
%s<br/>
===============================================<br/>
С уважением,<br/>
Команда WeChall<br/>
',
    'msg_alert_mails_sent' => 'Мы отправили %s писем администраторам сайта.',

    # 5.13 (Кодингекс)
    'draft' => 'Черновик CGX#%s',
    'vid' => 'Видео',
    'video' => 'Видео %s: %s',
    'video_box' => 'В этом уроке есть видео.',
    'click_to_expand' => 'Нажмите, чтобы посмотреть видео.',
    'problem' => 'Проблема CGX#%s',
    'problem_box' => '
В этом уроке есть интерактивная задача:<br/>
%s
<br/>
%s<br/>
<br/>
Проблема генерируется случайно и привязана к вашему сеансу.<br/>
<br/>
Удачи!<br/>
Команда WeChall',
    'btn_scored' => 'Задачи с очками',
    'btn_browse' => 'Просмотреть папку',
    'solver' => 'Отметить как решённое',
    'solver_box' => 'Это не задача, а видеоинструкция. Вы можете %s отметить проблему как решённую.',
    'click_here' => 'нажмите здесь',

    # Site Messenger contacts
    'th_site_discord' => 'Discord',
    'th_site_telegram' => 'Telegram',
    'th_site_whatsapp' => 'WhatsApp',
    'th_site_signal' => 'Signal',

    # Lounge chat
    'link_chatlounge' => 'Чат',
    'title_chatlounge' => 'WeChall IRC веб-чат',
    'info_chatlounge' =>
        "Мы создали новую страницу веб-чата на базе приложения 'thelounge'.<br/>\n
        Надеемся, что кому-то это понравится и пригодится.<br/>\n
        Конечно, лучше использовать полноценный клиент, например kvirc.<br/>\n
        <br/>\n
        Нажмите ссылку, чтобы начать чат: %s.<br/>\n",

    # admin "edit site"
    'th_no_email' => 'Сайт не хранит e-mail адреса пользователей',
);
