<?php
$lang = array(
'info' => '
Здравствуйте, представьте себе такую ситуацию <br/>
Существует канал IRC # wechall на irc.idlemonkeys.net
<br/>
Cервер отправляет сообщения всем людям в канале, а также обратно к отправителю.<br/>
<br/>
Когда каждую минуту один человек присоединяется и говорит привет,<br/>
Сколько &quot;привет&quot; сообщения были полностью отправлены на этом канале после 0xfffbadc0ded минут? <br/>	
Никто не покидает канал, получаетса 0xfffbadc0ded людей в конце;) <br/>
<br/>
Дополнительные разъяснения на 3 минути:<br/>
Канал пустой и было отправлено 0 сообщений<br/>
Первый пользователь присоединяется, передает привет, сервер посылает привет ему <br/>
Второй пользователь присоединяется, передает привет, сервер посылает привет ему <br/>
Третий пользователь присоединяется, передает привет, сервер посылает привет ему <br/>
<br/>
Минута 1: 2 отправленных сообщений, <br/>
Минута 2: 3 отправленных сообщений, <br/>
Минута 3: 4 отправленных сообщений, <br/>
Получаетса что  за 3 минута отправлены  9 сообщений <br/>
<br/>
Преобразование Примечания: 0xfffbadc0ded является шестнадцатеричной который преобразует в 17.591.026.060.781 (около 20 триллионов минут).<br/>
Пожалуйста, отправьте ваше решение в десятичной системе.',
);

?>