<?php
$lang = array(
	'pt_register' => GWF_SITENAME.'पर रजिस्टर.',
	'title_register' => 'रजिस्टर',
	'th_username' => 'उपयोगकर्ता नाम',
	'th_password' => 'पासवर्ड',
	'th_email' => 'ईमेल',
	'th_birthdate' => 'जन्मतिथि',
	'th_countryid' => 'देश',
	'th_tos' => 'मैं <br/> उपयोग की शर्तें सहमत हूं',
	'th_tos2' => 'मैं का प्रयोग करें <a href="%s">शर्तें</a> सहमत हूं<br/>',
	'th_register' => 'रजिस्टर',
	'btn_register' =>  'रजिस्टर',
	'err_register' => 'पंजीकरण प्रक्रिया के दौरान एक त्रुटि हुई ',
	'err_name_invalid' =>'आपका चुना प्रयोक्तानाम अमान्य है.',
	'err_name_taken' =>  'उपयोक्तानाम पहले से ही ले लिया है.',
	'err_country' => 'आपका चुना प्रयोक्तानाम अमान्य है.',
	'err_pass_weak' =>'आपका पासवर्ड भी कमजोर है. इसके अलावा, <b>महत्वपूर्ण पासवर्ड पुनः उपयोग करें</b>',
	'err_token' => 'आपका सक्रियकरण कोड अमान्य है. शायद आप पहले से ही सक्रिय रहे हैं.',
	'err_email_invalid' => 'आपका ईमेल अवैध है.',
	'err_email_taken' => 'आपका ईमेल पहले से ही ले लिया है.',
	'err_activate' => 'सक्रियण के दौरान कोई त्रुटि हुई.',
	       
	'msg_activated' => 'आपका खाता सक्रिय नहीं है. अब लॉगिन करने के लिए प्रयास करें.',
	'msg_registered' => 'आप पंजीकरण के लिए धन्यवाद.',
	'regmail_subject' => GWF_SITENAME.'पर रजिस्टर',
	'regmail_body' =>
		'हैलो%s<br/>'.
		'<br/>'.
		'तुम पर दर्ज करने के लिए धन्यवाद'.GWF_SITENAME.'<br/>'.
		'पंजीकरण पूरा करने, तुम पहले नीचे दिए गए लिंक पर जाकर अपने खाते को सक्रिय किया है.<br/>'.
		GWF_SITENAME.'यदि आप पंजीकृत नहीं किया, इस मेल को अनदेखा, या हमसे संपर्क करें'.GWF_SUPPORT_EMAIL.'<br/>'.
		'<br/>'.
		'%s<br/>'.
		'<br/>'.
		'%s'.
		'तरह सादर,<br/>'.
		GWF_SITENAME.'टीम',

	'err_tos' => 'आप EULA करने के लिए सहमत है.',
 
	'regmail_ptbody' =>
		'आपके लॉगिन क्रेडेंशियल हैं: <br/>'.
		'उपयोगकर्ता नाम: %s<br/>'.
		'पासवर्ड: %s<br/>'.
		'<br/>'.
		'यह एक अच्छा विचार है इस ईमेल और पासवर्ड को कहीं और दुकान हटाने के.<br/>'.
		'हम प्लेन टेक्स्ट में अपने पासवर्ड की दुकान नहीं है, तुम नहीं करना चाहिए कि या तो.<br/>'.
		'<br/>',
 
	### Admin Config ###
	'cfg_auto_login' => 'सक्रियकरण के बाद ऑटो लॉगइन',
	'cfg_captcha' => 'पंजीकरण के लिए कॅप्चा',
	'cfg_country_select' => 'दिखाएँ का चयन करें देश',
	'cfg_email_activation' =>'ईमेल पंजीकरण',
	'cfg_email_twice' => 'उसी ईमेल में दो बार रजिस्टर?',
	'cfg_force_tos' => 'एक मजबूर TOS दिखाएँ',
	'cfg_ip_usetime' => 'बहु - रजिस्टर के लिए आईपी टाइमआउट',
	'cfg_min_age' => 'न्यूनतम चयनकर्ता / उम्र जन्मदिन',
	'cfg_plaintextpass' => 'Plaintext में ईमेल पासवर्ड भेजें',
	'cfg_activation_pp' =>'व्यवस्थापक पृष्ठ के प्रति activations',
	'cfg_ua_threshold' => 'पंजीकरण पूरा करने के लिए समयबाह्य',
	 
	'err_birthdate' => 'आपका जन्म तिथि अमान्य है.',
	'err_minage' => 'क्षमा करें, लेकिन आप काफी पुराने रजिस्टर करने के लिए नहीं कर रहे हैं. आप कम से कम% s साल पुराना होने की जरूरत है',
	'err_ip_timeout' => 'किसी ने हाल ही में इस IP के साथ एक खाता पंजीकृत',
	'th_token' =>'टोकन',
	'th_timestamp' => 'समय रजिस्टर',
	'th_ip' => 'आईपी रेग',
	'tt_username' => 'प्रयोक्तानाम को एक पत्र के साथ शुरू है'.PHP_EOL.'यह केवल अक्षरों, अंकों और अंडरस्कोर शामिल कर सकते हैं. लंबाई से 3 है - %s वर्ण',
	'tt_email' => 'एक मान्य ईमेल रजिस्टर करने की आवश्यकता है.',
	 
	'info_no_cookie' => 'अपने ब्राउज़र कुकीज़ का समर्थन नहीं करता है या करता है की अनुमति के लिए उन्हें नहीं '.GWF_SITENAME.', लेकिन कुकीज़ प्रवेश के लिए आवश्यक हैं.',
	 
	# v2.01 (fixes)
	'msg_mail_sent' => 'आप अपने खाते को सक्रिय करने के लिए निर्देशों के साथ एक ईमेल भेजा गया है.',
	# v2.02 (Detect Country)
	'cfg_reg_detect_country' =>'हमेशा देश स्वत: पता लगाने के',
	 
	# v2.03 (Links)
	'btn_login' => 'लॉगिन',
	'btn_recovery' => 'वसूली पासवर्ड',
	# v2.04 (Fixes)
	'tt_password' => 'आपका पासवर्ड स्वतंत्र रूप से चुना जा सकता है है. महत्वपूर्ण पासवर्ड पुनः उपयोग करें. पासवर्ड के रूप में एक छोटे वाक्यांश पर विचार करें.',
	# v2.05 (Blacklist)
	'err_domain_banned' => 'आपका ईमेल प्रदाता काला सूची पर है.',
);
?>