<?php
$lang = array(
	'title' => 'Warchall - Глава I (Начало Warchall)',
	'info' =>
		'Теперь ты становишься линукс-суперхакером.<br/>'.PHP_EOL.
		'<br/>'.PHP_EOL.
		'Создай SSH-аккаунт через форму ниже.<br/>'.PHP_EOL.
		'Затем введи 6 решений для уровней 0–5, разделённых запятой.<br/>'.PHP_EOL.
		'Пример: bitwarrior,Solution1,Solution2,Solution3,Solution4,Solution5<br/>'.PHP_EOL.
		'<br/>'.PHP_EOL.
		'Гордо представлено командой The Warchall™<br/>'.PHP_EOL.
		'<b>Спасибо и респект xd-- за идею, мотивацию и вдохновение!</b><br/>'.PHP_EOL.
		'',

	'err_login' => 'Ты должен войти в систему, чтобы создать SSH-аккаунт для этого челленджа.',
	'err_score' => 'У тебя всего %s очков, а для создания SSH-аккаунта нужно %s очков.',
	'err_unix_username' => 'Твой логин на wechall нельзя преобразовать в unix-имя для warchall.<br/>Допустимы только символы a-zA-Z. :(',
	'err_retype' => 'Пароль введён повторно неверно.',
	
	'ft_create_ssh_account' => '(Пере)создать свой SSH-аккаунт',
	'th_password' => 'Пароль',
	'th_password2' => 'Повтор',
	'btn_submit' => 'Вперёд!',

	'msg_creating_account' =>
		'Хорошо, Челленджер, примерно через минуту ты сможешь войти через <b>ssh -p 19198 %s@warchall.net</b><br/>Используй пароль, введённый в форме. Обрати внимание, что имя пользователя переводится в нижний регистр.<br/><br/>Удачи в испытаниях!<br/>Команда warchall',
	
	'ft_setup_email' => 'Включить лог-файлы на e-mail',
	'btn_setmail' => 'Переключить',
	'msg_nomails' => 'Ты больше не будешь получать письма с лог-файлами.',
	'err_no_mail' => 'У тебя нет корректного контактного e-mail.',
	'msg_mail' => 'Теперь ты будешь получать письма с лог-файлами на свой основной e-mail.',
);

