<?php
$lang = array(
'menu_gb' => 'गेस्टबुक ',
'menu_dl' => 'डाउनलोड',
'menu_login' => 'लॉगिन',
'menu_register' => 'रजिस्टर',
'menu_logout' => 'लॉगआउट',
'menu_admin' => 'व्यवस्थापक',
'menu_links' => 'लिंक',
'menu_chat' => 'चैट',
'menu_profile' => 'प्रोफ़ाइल',
'pt_main' => 'B.AiM',
'mt_main' => 'BAiM, चिकित्सा, उपकरण, Playray, टॉस, गणना, धोखा, मदद,बिलियर्ड, पूल बी AIM, लक्ष्य',
'md_main' =>'बी लक्ष्य एक उपकरण है कि आप Playray पूल बिलियर्ड पर लक्ष्य में मदद करता है है. यह स्नूकर और Eightball टेबल के साथ काम करता है.',
'main_intro2' => 'Gizmore लिखते हैं:',
'main_info2' =>
'बी AIM एक उद्देश्य बीओटी के लिए एक अच्छी तरह से किया कार्यान्वयन है.'.
'Sourcecode पतली है और ऐसा लगता है कि एक ट्रोजन या अन्य दुर्भावनापूर्ण भागों शामिल नहीं है.',
'main_intro' => '(बीटी) लेखक लिखते हैं: ',
'main_info' =>
'मैं बी AIM के लिए विचार है जबकि नीदरलैंड में एक छुट्टी के दौरान पूल खेल.
क्योंकि मैं होटल में शाम में ऊब गया था, मैं खुद के लिए सोचा,
एक प्रोग्राम है जो पूल tosses की गणना लिखने और यह vizualize.
मैं भाग्यशाली था और अभी भी अपने लैपटॉप पर Delphi7 मिला, तो मैं सही दूर कोडन शुरू कर सकता है.
मैं उत्सुक था मैं भौतिकी सबसे अच्छा कैसे लागू कर सकता है, और एक पूल अनुकरण के लिए गूगल खोज की.
मैं गूगल द्वारा Playray पाया, और तुरंत एक अवधारणा के विचार.
5 एक घंटे प्रत्येक दिन के बाद, बी AIM के पहले संस्करण में किया गया था.
तो, कार्यक्रम एक छुट्टी है, कारण ऊब और सबसे अच्छा करने के लिए इस तरह के एक परियोजना का एहसास कैसे curiousity के भीतर बनाया गया है.
कारण है कि Playray चुना मिला एक शुद्ध दुर्घटना थी. मैं पहले साइट नहीं पता है. था ',
'pt_download' => 'डाउनलोड बी',
'download_info' => 'यहाँ आप बी AIM डाउनलोड कर सकते हैं. यह केवल प्रदर्शन प्रयोजनों के लिए उपयोग करें.',
'download_link' => 'baim.tar.gz (. exe और sourcecode)',
 
####
'err_not_purchased' => 'तुम बी AIM खरीद के क्रम में अपनी कॉपी अनलॉक है.',
'menu_mc' => 'अनलॉक',
'menu_forum' => 'फोरम',
'menu_account' => 'खाता',
'menu_news' =>  'न्यूज',
'menu_pm' => 'PM',
'ft_set_mc' => 'अनलॉक AIM बी',
'msg_set_mc' => 'आपके प्रति फिर से खुला है. B.AiM.exe अब शुरू करें.',
'err_change_freq' => 'तुम बी उद्देश्य के अपने प्रतिलिपि हाल ही में खुला. आप इस %s एस में फिर से करना करने के लिए अनुमति दी जाती है',
####
'key.dat' => '%s-%s',
'readme.txt' =>
"हैलो% s \r\n\r\n".
"आपको बहुत बहुत धन्यवाद बी का उद्देश्य \r\n\r\nअपनी खरीद के लिए".
"परिचय: \r\n".
"B.AiM.exe प्रारंभ तालिका के ऊपर खिड़की ले जाएँ, तो बिंदीदार रेखा पूल टेबल (तुम्हारा सबसे अच्छा अनुभव के लिए एक बिट प्रयोग) के किनारों से मेल खाती है और वैकल्पिक रूप से आप देखें> खिड़कियों स्वतः तस्वीर समायोजित ऑटो क्लिक कर सकते हैं.. जैसे ही आप सफेद गेंद रखा, मेज से दूर अपने माउस को स्थानांतरित करने के लिए मेज पर गेंदों की स्थिति का पता लगाने के बाद आप के लिए उद्देश्य शुरू और गेंदों को हिट कर सकते हैं. गेंदों स्कैनिंग की एक बेहतर दर के लिए छाया को अक्षम करने की सिफारिश की है \! r \n\r\n".
"ज्ञात कीड़े: \r\n".
"कुछ सिस्टम पर यह है कि खेल धीमा और गेंद धीरे धीरे कदम क्या यह कुछ जावा संस्करणों की एक ज्ञात समस्या बी AIM के कारण बग नहीं है. सकता है! यह नवीनतम जावा रनटाइम वातावरण स्थापित करने में मदद करनी चाहिए \r\n\r\n".
"किसी भी मैलवेयर से मुक्त कार्यक्रम मामले में अपने एंटीवायरस समाधान एक चेतावनी चलाता है, यह गलत है!".
"मामले में आप एक अलग स्रोत से बी AIM मिला, तो आप सावधान यद्यपि किया जाना चाहिए \r\n\r\n".
"बी \r\nउद्देश्य के साथ मज़े".
"- लेखक - \r\n\r\n\r\n".
"यदि आप किसी भी मुसीबत है, कृपया हमें support@baim.gizmore.org करने के लिए मेल भेजने के लिए, हम तुम जल्दी \r\nमें मदद की कोशिश करेंगे".
"यदि आप अपने कंप्यूटर स्विच, आप वेबसाइट पर अपनी कॉपी अनलॉक खाता -> अनलॉक. \ R \n\r\nके तहत कर सकते हैं".
"तरह सादर \r\n".
"बी कर्मचारी AIM",
 ####
'dl_info_t' => 'बी AIM इन्फो डाउनलोड',
'dl_info_b' =>
 'यहाँ हैं <br/> बी उद्देश्य के लिए एक कुछ रिलीज नोट्स'.
'<br/>'.
'सरकारी समर्थन <b>%s</b>. <br/> पर खत्म हो जाएगा'.
'बी उद्देश्य के हर संस्करण अद्वितीय है. तुम अपनी कॉपी साझा पुनर्वितरित या नहीं हो सकता है <br/>'.
'प्रत्येक प्रतिलिपि के लिए केवल एक ही कंप्यूटर पर चलाने के लिए डिज़ाइन किया गया है. जब आप अपने कंप्यूटर को बदलने के लिए, आप अपने प्रति फिर से अनलॉक कर सकते हैं, लेकिन केवल इतना हर%s एस<br/> ऐसा कर सकते हैं'.
'<br/>'.
'वर्तमान में, आप केवल <एक के माध्यम से खरीद सकते हैं'.
'<a href="https://www.paypal.com/en">पेपैल</a> ExpressCheckout और <a href="http://www.paysafecard.com">PaySafeCard</a>.<br/>'.
'पेपैल के माध्यम से खरीद करने के लिए, पेपैल बटन तीन बार यहाँ क्लिक करें. 1) Paypal, 2 चुनें) गोटो पेपैल, 3) वापस आओ, पुष्टि करें और लेन - देन करना <br/>..
PaySafe माध्यम से खरीद करने के लिए, आप करने के लिए हमें PM माध्यम से अपना पिन / आईडी दे और हम आप हाथ से अनलॉक जाएगा.<br/>'.
'<br/>'.
'यह संभव है कि सर्वर है कि प्रतिलिपि संरक्षण के लिए जिम्मेदार है downtimes <br/>.'.
'हम बाहर का सबसे अच्छा प्रयास करने के लिए जितनी जल्दी हो सके किसी भी डाउनटाइम को हल करेगा <br/>.'.
'क्या हम नहीं <b> </b> पर गारंटी है कि बी AIM हमेशा के लिए काम करेंगे, लेकिन हम अपनी पूरी कोशिश करने के लिए किसी भी मुद्दे को ठीक कर देंगे.',
'err_no_mc' => 'इस उपयोगकर्ता एक एम सी सेट नहीं है.',
'err_mc_cheater' => 'उपयोगकर्ताओं एमसी डुप्लिकेट है!',
'msg_new_demo' => 'उपयोगकर्ता% एस मिला है उसकी / उसके डेमो रिकॉर्ड नष्ट कर दिया. वह / वह डेमो फिर से डाउनलोड है.',
 
);
 
?>